
let sc = '每你妳专业丛东丝丢两严丧临为丽举义乌乐乔习书买亏亚产亩亲亵亿仅仑仓仪们优伙伛伞伟传伤伥伦伧伪伫佣佥侣侥侦侧侨侩侪侬俦俨俩俪俭债倾偻偿傥傧储傩兑兰关兴养兽冈军农冯冻净减凑凤凫凯击凿刍划刘则刚创删别刭剀剂剑剧劝办务动劲劳势勋匮华协单卖卢卤卧卫厅历压厌厕厢县叆叇发变叠叹吓吕吨吴呒呓呗员呙呜咔咛哌哑哕哗哙唤啧啬啭啮啰啸喷嗫嗳嘤噜噼嚣嚯团园围图圆圹场块坚坛坝坞坟坠垄垅垆垒垦垧垩埘埚堑墙壳壶壸处备复头夺奁奂奋奖妆妇妈妪娅娇娱娲娴婴婵媪嫔嫱孙孪宁实宠审宪宫宽宾对寻导尘尧层屿岁岂岖岗岘岚岛岭峣峤峥崄崭嵘嵚嵴巩币帅师帏帐帜带帧帱帻帼幂庆庐庑库应庞废廪开异张弹归录彻徕忆忏忧忾怀态怂怃怅怆总怼怿恳恶恸恺恻恼恽悫悬悭悯惊惩惫惬惭惮惯愤慑慭懑懒懔戋戏战戬户执扩扪扫扬扰抚抟抡抢护报拟拣拥拨择挚挝挞挠挤挥捞损捡换捣掷掺揽搀搁搅摄摅摆摇摈摊撄撷擞攒敌敛斋斩时旷旸昙显晓晔晕晖暂暧术杀杂杨极构枞枣枥枨枪枫枭柜柠柽栀标栈栉栋栌栎栏树样栾桠桡桢桤桥桦桩检棂椠椭榄榇榈槚槛槟槠樯樱橹橼欢歼殁殇殒殚殡毁毂毕毙氲汇汉污汤汹沟沤沥沦沧沨沵泞泷泸泻泼泽泾洼浃浆浇浊测济浏浑浒浓浔涟涡涣涤润涧涨涩渍渎渐渔渖溃溅滚满滢滤滥滨滩漤潇潋澜濑濒灏灭灵灿炀炖炜炼炽烁烂烛烦烧烨烬热焕焘煅煳熘爱爷牍牵牺犊犟犷狈狞狮狯狱猎猕猬獭玑玙玛玮环现珐珑珰珲琏琐琼璎瓒电畅疗疟疠疡疮疯痈痉痨痫瘗瘫瘿癞癣癫皑皱皲盏盐监盘睁睑瞒矫矶矾矿码砖砗砚砻砾础硕硖硗硙确硷碛磙祯祸秃秆种积秽秾稆稣稳穑穷窍窑窜窝窥窦窭竖竞笃笕笺笼筚筛筹签简箓箦箧箩箫篑篓篮篱籁籴粜粝粪糁紧纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纽纾线绀绁练组绅细织终绊绍绎经绐绒结绔绕绗绘给绚绛络绞统绠绢绣绤绥绦继绩绪绫续绮绯绰绳维绵绶绷绸绹绻综绽绾绿缀缁缄缅缆缇缈缉缊缋缎缐缑缒缓缔缕编缗缘缙缚缛缝缟缠缢缣缤缥缦缧缨缩缪缬缭缮缯缲缴缵罂罗罚罢罴羁翘翚耸聂聋职聍联聩聪肃肠肤肷肾肿胀胁胜胧胪胫胶脍脐脑脓脔脸腘腭腻腼腽腾膑舆舣舰舱舻艰艳艺节芜苇苌苍苎苏茏茑茔茕茧荆荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫药莲莳莴获莸莹莺莼萝萤营萦萧萨蓝蓟蓣蓦蔷蔺蔼蕴藓虏虑虾虿蚀蚁蚝蚬蛊蛏蛰蛱蛲蜕蜗蜡蝇蝼蝾衅衔补衬衮袄袅袆袜袭裈褛褴襕见观规觅视觇览觉觊觋觌觎觏觐觞誊讠计订讣认讥讦讧讨让讪讫训议讯记讱讲讳讴讵讶讷许讹论讼讽设访诀证诂诃评诅识诈诉诊诋词诏译诒诔试诖诗诘诙诚诛话诞诟诠诡询诣诤该详诧诨诫诬语诮误诰诱诲诳说诵请诸诹诺读诽课谀谁调谄谅谆谈谊谋谌谍谏谐谑谒谓谔谕谗谘谙谚谛谜谝谟谠谡谢谣谤谥谦谧谨谩谪谬谭谮谱谲谳谴谵谶贝贞负贡财责贤败货质贩贪贫贬购贮贯贰贱贲贳贴贵贷贸费贺贻贼贽贾贿赀赁赂赃资赆赈赉赋赌赍赎赏赐赑赒赓赔赖赘赙赚赛赜赞赟赠赡赢赣赪赵趋跃跄跞跷跸跻踌踬踯蹑蹒躏车轧轨轩轪轫转轭轮软轰轲轳轴轵轶轸轹轻轼载轾轿辂较辄辅辆辇辈辉辍辎辏辐辑输辔辕辖辗辘辙辩辫边辽达迁过运还这进远违连迟迳选逊递逻遗邓邝邮邹邻郄郑郦郸酝酦酱酿释鉴銮錾针钉钊钍钏钐钓钗钝钞钟钢钣钤钥钦钧钩钮钰钱钲钳钴钶钹钺钻钾钿铁铂铃铄铅铆铉铊铍铎铗铙铛铜铠铢铣铤铦铨铫铭铮铰铳银铸铺铻链铿销锁锄锅锈锋锐锓锖错锚锜锟锡锢锣锤锥锦锬锭键锯锱锲锳锴锵锷锹锺锻锽锾镀镂镇镈镊镌镐镒镕镖镛镜镝镞镠镡镢镣镦镫镮镱镴镶长门闩闪闭问闯闰闲间闵闷闸闹闺闻闼闽闾阀阁阃阄阅阇阈阉阋阍阎阏阐阑阒阔阖阙队阳阴阵阶际陆陇陈陉陕陨险隐隽难雏雠雳雾霁霭靓靥鞑韦韩韪韫韬页顶顷项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颍颐频颓颔颕颖颗题颙颚颛颜额颞颠颡颢颤颥颦颧风飏飒飓飔飘飙飚飞飨餍饥饦饧饨饫饬饭饮饯饰饱饲饴饵饶饷饺饼饿馀馁馅馆馈馏馑馒馔马驭驮驯驰驱驲驳驴驶驷驹驺驻驼驽驾驿骀骁骂骄骅骆骇骈骉骊骋验骍骎骏骐骑骓骖骗骘骙骚骛骝骞骟骠骡骤骥骧髅鬓魇魉鱼鲁鲂鲆鲇鲈鲊鲋鲍鲑鲔鲙鲛鲜鲞鲠鲣鲤鲧鲨鲩鲫鲬鲭鲰鲱鲲鲳鲵鲶鲷鲸鲹鲻鲽鳀鳁鳃鳄鳅鳆鳇鳌鳍鳏鳔鳕鳗鳞鳟鳢鳣鸟鸠鸢鸣鸥鸦鸨鸩鸪鸫鸬鸭鸯鸰鸱鸳鸴鸵鸷鸺鸽鸾鸿鹀鹂鹃鹄鹅鹈鹉鹊鹍鹎鹏鹑鹔鹗鹘鹜鹞鹟鹡鹢鹤鹥鹦鹧鹩鹪鹫鹬鹭鹰鹳黉黡黩黾齐齑齿龀龂龃龄龆龈龉龊龋龌龙龚龛龟尝闹钟闲脏为发饥叹复炼掷鉴获唿呢啦值吧响类嗎查說说說卡晚儍雞！？';
let tc = '毎袮袮專業叢東絲丟兩嚴喪臨為麗舉義烏樂喬習書買虧亞產畝親褻億僅侖倉儀們優夥傴傘偉傳傷倀倫傖偽佇傭僉侶僥偵側僑儈儕儂儔儼倆儷儉債傾僂償儻儐儲儺兌蘭關興養獸岡軍農馮凍淨減湊鳳鳧凱擊鑿芻劃劉則剛創刪別剄剴劑劍劇勸辦務動勁勞勢勳匱華協單賣盧鹵臥衛廳曆壓厭廁廂縣靉靆發變疊歎嚇呂噸吳嘸囈唄員咼嗚哢嚀呱啞噦嘩噲喚嘖嗇囀齧囉嘯噴囁噯嚶嚕劈囂謔團園圍圖圓壙場塊堅壇壩塢墳墜壟壟壚壘墾坰堊塒堝塹牆殼壺壼處備複頭奪奩奐奮獎妝婦媽嫗婭嬌娛媧嫻嬰嬋媼嬪嬙孫孿寧實寵審憲宮寬賓對尋導塵堯層嶼歲豈嶇崗峴嵐島嶺嶢嶠崢嶮嶄嶸嶔脊鞏幣帥師幃帳幟帶幀幬幘幗冪慶廬廡庫應龐廢廩開異張彈歸錄徹徠憶懺憂愾懷態慫憮悵愴總懟懌懇惡慟愷惻惱惲愨懸慳憫驚懲憊愜慚憚慣憤懾憖懣懶懍戔戲戰戩戶執擴捫掃揚擾撫摶掄搶護報擬揀擁撥擇摯撾撻撓擠揮撈損撿換搗擲摻攬攙擱攪攝攄擺搖擯攤攖擷擻攢敵斂齋斬時曠暘曇顯曉曄暈暉暫曖術殺雜楊極構樅棗櫪棖槍楓梟櫃檸檉梔標棧櫛棟櫨櫟欄樹樣欒椏橈楨榿橋樺樁檢欞槧橢欖櫬櫚檟檻檳櫧檣櫻櫓櫞歡殲歿殤殞殫殯毀轂畢斃氳彙漢汙湯洶溝漚瀝淪滄渢濔濘瀧瀘瀉潑澤涇窪浹漿澆濁測濟瀏渾滸濃潯漣渦渙滌潤澗漲澀漬瀆漸漁瀋潰濺滾滿瀅濾濫濱灘濫瀟瀲瀾瀨瀕灝滅靈燦煬燉煒煉熾爍爛燭煩燒燁燼熱煥燾煆糊溜愛爺牘牽犧犢強獷狽獰獅獪獄獵獼蝟獺璣璵瑪瑋環現琺瓏璫琿璉瑣瓊瓔瓚電暢療瘧癘瘍瘡瘋癰痙癆癇瘞癱癭癩癬癲皚皺皸盞鹽監盤睜瞼瞞矯磯礬礦碼磚硨硯礱礫礎碩硤磽磑確鹼磧滾禎禍禿稈種積穢穠穭穌穩穡窮竅窯竄窩窺竇窶豎競篤筧箋籠篳篩籌簽簡籙簀篋籮簫簣簍籃籬籟糴糶糲糞糝緊糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紐紓線紺絏練組紳細織終絆紹繹經紿絨結絝繞絎繪給絢絳絡絞統綆絹繡綌綏絛繼績緒綾續綺緋綽繩維綿綬繃綢綯綣綜綻綰綠綴緇緘緬纜緹緲緝縕繢緞線緱縋緩締縷編緡緣縉縛縟縫縞纏縊縑繽縹縵縲纓縮繆纈繚繕繒繰繳纘罌羅罰罷羆羈翹翬聳聶聾職聹聯聵聰肅腸膚膁腎腫脹脅勝朧臚脛膠膾臍腦膿臠臉膕齶膩靦膃騰臏輿艤艦艙艫艱豔藝節蕪葦萇蒼苧蘇蘢蔦塋煢繭荊莢蕘蓽蕎薈薺蕩榮葷滎犖熒蕁藎蓀蔭藥蓮蒔萵獲蕕瑩鶯蓴蘿螢營縈蕭薩藍薊蕷驀薔藺藹蘊蘚虜慮蝦蠆蝕蟻蠔蜆蠱蟶蟄蛺蟯蛻蝸蠟蠅螻蠑釁銜補襯袞襖嫋褘襪襲褌褸襤襴見觀規覓視覘覽覺覬覡覿覦覯覲觴謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥許訛論訟諷設訪訣證詁訶評詛識詐訴診詆詞詔譯詒誄試詿詩詰詼誠誅話誕詬詮詭詢詣諍該詳詫諢誡誣語誚誤誥誘誨誑說誦請諸諏諾讀誹課諛誰調諂諒諄談誼謀諶諜諫諧謔謁謂諤諭讒諮諳諺諦謎諞謨讜謖謝謠謗諡謙謐謹謾謫謬譚譖譜譎讞譴譫讖貝貞負貢財責賢敗貨質販貪貧貶購貯貫貳賤賁貰貼貴貸貿費賀貽賊贄賈賄貲賃賂贓資贐賑賚賦賭齎贖賞賜贔賙賡賠賴贅賻賺賽賾讚贇贈贍贏贛赬趙趨躍蹌躒蹺蹕躋躊躓躑躡蹣躪車軋軌軒軑軔轉軛輪軟轟軻轤軸軹軼軫轢輕軾載輊轎輅較輒輔輛輦輩輝輟輜輳輻輯輸轡轅轄輾轆轍辯辮邊遼達遷過運還這進遠違連遲逕選遜遞邏遺鄧鄺郵鄒鄰郤鄭酈鄲醞醱醬釀釋鑒鑾鏨針釘釗釷釧釤釣釵鈍鈔鍾鋼鈑鈐鑰欽鈞鉤鈕鈺錢鉦鉗鈷鈳鈸鉞鑽鉀鈿鐵鉑鈴鑠鉛鉚鉉鉈鈹鐸鋏鐃鐺銅鎧銖銑鋌銛銓銚銘錚鉸銃銀鑄鋪鋙鏈鏗銷鎖鋤鍋鏽鋒銳鋟錆錯錨錡錕錫錮鑼錘錐錦錟錠鍵鋸錙鍥鍈鍇鏘鍔鍬鍾鍛鍠鍰鍍鏤鎮鎛鑷鐫鎬鎰鎔鏢鏞鏡鏑鏃鏐鐔钁鐐鐓鐙鐶鐿鑞鑲長門閂閃閉問闖閏閑間閔悶閘鬧閨聞闥閩閭閥閣閫鬮閱闍閾閹鬩閽閻閼闡闌闃闊闔闕隊陽陰陣階際陸隴陳陘陝隕險隱雋難雛讎靂霧霽靄靚靨韃韋韓韙韞韜頁頂頃項順須頊頑顧頓頎頒頌頏預顱領頗頸頡頰潁頤頻頹頷頴穎顆題顒顎顓顏額顳顛顙顥顫顬顰顴風颺颯颶颸飄飆飆飛饗饜饑飥餳飩飫飭飯飲餞飾飽飼飴餌饒餉餃餅餓餘餒餡館饋餾饉饅饌馬馭馱馴馳驅馹駁驢駛駟駒騶駐駝駑駕驛駘驍罵驕驊駱駭駢驫驪騁驗騂駸駿騏騎騅驂騙騭騤騷騖騮騫騸驃騾驟驥驤髏鬢魘魎魚魯魴鮃鯰鱸鮓鮒鮑鮭鮪鱠鮫鮮鯗鯁鰹鯉鯀鯊鯇鯽鯒鯖鯫鯡鯤鯧鯢鯰鯛鯨鯵鯔鰈鯷鰮鰓鱷鰍鰒鰉鼇鰭鰥鰾鱈鰻鱗鱒鱧鱣鳥鳩鳶鳴鷗鴉鴇鴆鴣鶇鸕鴨鴦鴒鴟鴛鴬鴕鷙鵂鴿鸞鴻鵐鸝鵑鵠鵝鵜鵡鵲鶤鵯鵬鶉鷫鶚鶻鶩鷂鶲鶺鷁鶴鷖鸚鷓鷯鷦鷲鷸鷺鷹鸛黌黶黷黽齊齏齒齔齗齟齡齠齦齬齪齲齷龍龔龕龜嘗鬨鐘閒臟爲髮飢嘆復鍊攫鑑穫呼昵拉値叭響類麼査説説説卞晩傻鸡!?';



// scArr = sc.split('');
// tcArr = tc.split('');
// scmm=[];
// tcmm=[];
// nsc = [];
// ntc = [];
// tcArr.forEach((m,i)=>{
// 	// console.log(m,i)
// 	if(!EVAMatisseClassicMojis.includes(m)){
// 		scmm.push(scArr[i]);
// 		tcmm.push(tcArr[i]);
// 	}else{
// 		nsc.push(scArr[i]);
// 		ntc.push(tcArr[i]);
// 	}
// });

// // console.log(/diff/,scArr.length - sc.length,tcmm.length,scArr.join(''),tcArr.join(''));
// console.log(/diff/,tcmm.length);
// console.log(`let sc = '${nsc.join('')}';`);
// console.log(`let tc = '${ntc.join('')}';`);
// console.log(`// let scmm = '${scmm.join('')}';`);
// console.log(`// let tcmm = '${tcmm.join('')}';`);



// // 找未对应上的文字
// scArr = sc.split('');
// tcArr = tc.split('');
// scArr.forEach((m,i)=>{
// 	if(!EVAMatisseClassicMojis.includes(m)){
// 		// console.log(m);
// 		if(!EVAMatisseClassicMojis.includes(tcArr[i])){
// 			console.log(/繁体也没有/,m,tcArr[i]);
// 		}
// 	}
// });


// 丟 实际可以显示 但是 过不去 fontmin

const transformFunc = {
	1(cc) {
		let str = "";
		for (let i = 0; i < cc.length; i++) {
			if (cc.charCodeAt(i) > 10000 && tc.indexOf(cc.charAt(i)) != -1) {
				str += sc.charAt(tc.indexOf(cc.charAt(i)));
			} else {
				str += cc.charAt(i);
			}
		}
		return str;
	},
	2(cc) {
		let str = "";
		for (let i = 0; i < cc.length; i++) {
			if (cc.charCodeAt(i) > 10000 && sc.indexOf(cc.charAt(i)) != -1) {
				str += tc.charAt(sc.indexOf(cc.charAt(i)));
			} else {
				str += cc.charAt(i);
			}
		}
		// str = str.replace('你','你');
		return str;
	}
};


// export {
// 	transformFunc
// }
